Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfrbu.h
/*
 * Component description for SFRBU
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-10T14:22:36Z */
#ifndef _PIC32CXMTC_SFRBU_COMPONENT_H_
#define _PIC32CXMTC_SFRBU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SFRBU                                        */
/* ************************************************************************** */

/* -------- SFRBU_XTAL_TRIM : (SFRBU Offset: 0x10) (R/W 32) XTAL Oscillator Trimming Register -------- */
#define SFRBU_XTAL_TRIM_XTAL_TRIM_Pos         _UINT32_(0)                                          /* (SFRBU_XTAL_TRIM) 32 kHz Crystal Oscillator Trimming Value Position */
#define SFRBU_XTAL_TRIM_XTAL_TRIM_Msk         (_UINT32_(0x3) << SFRBU_XTAL_TRIM_XTAL_TRIM_Pos)     /* (SFRBU_XTAL_TRIM) 32 kHz Crystal Oscillator Trimming Value Mask */
#define SFRBU_XTAL_TRIM_XTAL_TRIM(value)      (SFRBU_XTAL_TRIM_XTAL_TRIM_Msk & (_UINT32_(value) << SFRBU_XTAL_TRIM_XTAL_TRIM_Pos)) /* Assigment of value for XTAL_TRIM in the SFRBU_XTAL_TRIM register */
#define SFRBU_XTAL_TRIM_Msk                   _UINT32_(0x00000003)                                 /* (SFRBU_XTAL_TRIM) Register Mask  */


/* -------- SFRBU_TRIM : (SFRBU Offset: 0x14) ( R/ 32) Trimming Bits Register -------- */
#define SFRBU_TRIM_RC32_Pos                   _UINT32_(0)                                          /* (SFRBU_TRIM) RC Oscillator Trimming Value Position */
#define SFRBU_TRIM_RC32_Msk                   (_UINT32_(0x3F) << SFRBU_TRIM_RC32_Pos)              /* (SFRBU_TRIM) RC Oscillator Trimming Value Mask */
#define SFRBU_TRIM_RC32(value)                (SFRBU_TRIM_RC32_Msk & (_UINT32_(value) << SFRBU_TRIM_RC32_Pos)) /* Assigment of value for RC32 in the SFRBU_TRIM register */
#define SFRBU_TRIM_CONVBG_Pos                 _UINT32_(8)                                          /* (SFRBU_TRIM) Conversion IP Bandgap Trimming Value Position */
#define SFRBU_TRIM_CONVBG_Msk                 (_UINT32_(0xF) << SFRBU_TRIM_CONVBG_Pos)             /* (SFRBU_TRIM) Conversion IP Bandgap Trimming Value Mask */
#define SFRBU_TRIM_CONVBG(value)              (SFRBU_TRIM_CONVBG_Msk & (_UINT32_(value) << SFRBU_TRIM_CONVBG_Pos)) /* Assigment of value for CONVBG in the SFRBU_TRIM register */
#define SFRBU_TRIM_LDO_Pos                    _UINT32_(16)                                         /* (SFRBU_TRIM) Power Management IP LDO Trimming Value Position */
#define SFRBU_TRIM_LDO_Msk                    (_UINT32_(0xF) << SFRBU_TRIM_LDO_Pos)                /* (SFRBU_TRIM) Power Management IP LDO Trimming Value Mask */
#define SFRBU_TRIM_LDO(value)                 (SFRBU_TRIM_LDO_Msk & (_UINT32_(value) << SFRBU_TRIM_LDO_Pos)) /* Assigment of value for LDO in the SFRBU_TRIM register */
#define SFRBU_TRIM_LCD_Pos                    _UINT32_(24)                                         /* (SFRBU_TRIM) LDO Internal Bandgap Trimming for LCD Driver Position */
#define SFRBU_TRIM_LCD_Msk                    (_UINT32_(0xF) << SFRBU_TRIM_LCD_Pos)                /* (SFRBU_TRIM) LDO Internal Bandgap Trimming for LCD Driver Mask */
#define SFRBU_TRIM_LCD(value)                 (SFRBU_TRIM_LCD_Msk & (_UINT32_(value) << SFRBU_TRIM_LCD_Pos)) /* Assigment of value for LCD in the SFRBU_TRIM register */
#define SFRBU_TRIM_Msk                        _UINT32_(0x0F0F0F3F)                                 /* (SFRBU_TRIM) Register Mask  */


/* -------- SFRBU_BOOT : (SFRBU Offset: 0x20) (R/W 32) Boot Register -------- */
#define SFRBU_BOOT_SOURCE_Pos                 _UINT32_(0)                                          /* (SFRBU_BOOT) Source for Booting Sequence Position */
#define SFRBU_BOOT_SOURCE_Msk                 (_UINT32_(0x1) << SFRBU_BOOT_SOURCE_Pos)             /* (SFRBU_BOOT) Source for Booting Sequence Mask */
#define SFRBU_BOOT_SOURCE(value)              (SFRBU_BOOT_SOURCE_Msk & (_UINT32_(value) << SFRBU_BOOT_SOURCE_Pos)) /* Assigment of value for SOURCE in the SFRBU_BOOT register */
#define SFRBU_BOOT_Msk                        _UINT32_(0x00000001)                                 /* (SFRBU_BOOT) Register Mask  */


/* -------- SFRBU_IO_RETENTION : (SFRBU Offset: 0x30) (R/W 32) IO Retention Register -------- */
#define SFRBU_IO_RETENTION_PA_7_0_Pos         _UINT32_(0)                                          /* (SFRBU_IO_RETENTION) Keep Function on PA0 to PA7 Position */
#define SFRBU_IO_RETENTION_PA_7_0_Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_7_0_Pos)     /* (SFRBU_IO_RETENTION) Keep Function on PA0 to PA7 Mask */
#define SFRBU_IO_RETENTION_PA_7_0(value)      (SFRBU_IO_RETENTION_PA_7_0_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_7_0_Pos)) /* Assigment of value for PA_7_0 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PA_15_8_Pos        _UINT32_(1)                                          /* (SFRBU_IO_RETENTION) Keep Function on PA8 to PA15 Position */
#define SFRBU_IO_RETENTION_PA_15_8_Msk        (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_15_8_Pos)    /* (SFRBU_IO_RETENTION) Keep Function on PA8 to PA15 Mask */
#define SFRBU_IO_RETENTION_PA_15_8(value)     (SFRBU_IO_RETENTION_PA_15_8_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_15_8_Pos)) /* Assigment of value for PA_15_8 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PA_23_16_Pos       _UINT32_(2)                                          /* (SFRBU_IO_RETENTION) Keep Function on PA16 to PA23 Position */
#define SFRBU_IO_RETENTION_PA_23_16_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_23_16_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PA16 to PA23 Mask */
#define SFRBU_IO_RETENTION_PA_23_16(value)    (SFRBU_IO_RETENTION_PA_23_16_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_23_16_Pos)) /* Assigment of value for PA_23_16 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PA_31_24_Pos       _UINT32_(3)                                          /* (SFRBU_IO_RETENTION) Keep Function on PA24 to PA31 Position */
#define SFRBU_IO_RETENTION_PA_31_24_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_31_24_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PA24 to PA31 Mask */
#define SFRBU_IO_RETENTION_PA_31_24(value)    (SFRBU_IO_RETENTION_PA_31_24_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_31_24_Pos)) /* Assigment of value for PA_31_24 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PB_7_0_Pos         _UINT32_(4)                                          /* (SFRBU_IO_RETENTION) Keep Function on PB0 to PB7 Position */
#define SFRBU_IO_RETENTION_PB_7_0_Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_7_0_Pos)     /* (SFRBU_IO_RETENTION) Keep Function on PB0 to PB7 Mask */
#define SFRBU_IO_RETENTION_PB_7_0(value)      (SFRBU_IO_RETENTION_PB_7_0_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_7_0_Pos)) /* Assigment of value for PB_7_0 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PB_15_8_Pos        _UINT32_(5)                                          /* (SFRBU_IO_RETENTION) Keep Function on PB8 to PB15 Position */
#define SFRBU_IO_RETENTION_PB_15_8_Msk        (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_15_8_Pos)    /* (SFRBU_IO_RETENTION) Keep Function on PB8 to PB15 Mask */
#define SFRBU_IO_RETENTION_PB_15_8(value)     (SFRBU_IO_RETENTION_PB_15_8_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_15_8_Pos)) /* Assigment of value for PB_15_8 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PB_23_16_Pos       _UINT32_(6)                                          /* (SFRBU_IO_RETENTION) Keep Function on PB216 to PB23 Position */
#define SFRBU_IO_RETENTION_PB_23_16_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_23_16_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PB216 to PB23 Mask */
#define SFRBU_IO_RETENTION_PB_23_16(value)    (SFRBU_IO_RETENTION_PB_23_16_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_23_16_Pos)) /* Assigment of value for PB_23_16 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PB_26_24_Pos       _UINT32_(7)                                          /* (SFRBU_IO_RETENTION) Keep Function on PB24 to PB26 Position */
#define SFRBU_IO_RETENTION_PB_26_24_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_26_24_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PB24 to PB26 Mask */
#define SFRBU_IO_RETENTION_PB_26_24(value)    (SFRBU_IO_RETENTION_PB_26_24_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_26_24_Pos)) /* Assigment of value for PB_26_24 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PC_7_0_Pos         _UINT32_(8)                                          /* (SFRBU_IO_RETENTION) Keep Function on PC0 to PC7 Position */
#define SFRBU_IO_RETENTION_PC_7_0_Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PC_7_0_Pos)     /* (SFRBU_IO_RETENTION) Keep Function on PC0 to PC7 Mask */
#define SFRBU_IO_RETENTION_PC_7_0(value)      (SFRBU_IO_RETENTION_PC_7_0_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PC_7_0_Pos)) /* Assigment of value for PC_7_0 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PC_15_8_Pos        _UINT32_(9)                                          /* (SFRBU_IO_RETENTION) Keep Function on PC8 to PC15 Position */
#define SFRBU_IO_RETENTION_PC_15_8_Msk        (_UINT32_(0x1) << SFRBU_IO_RETENTION_PC_15_8_Pos)    /* (SFRBU_IO_RETENTION) Keep Function on PC8 to PC15 Mask */
#define SFRBU_IO_RETENTION_PC_15_8(value)     (SFRBU_IO_RETENTION_PC_15_8_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PC_15_8_Pos)) /* Assigment of value for PC_15_8 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PC_22_16_Pos       _UINT32_(10)                                         /* (SFRBU_IO_RETENTION) Keep Function on PC16 to PC22 Position */
#define SFRBU_IO_RETENTION_PC_22_16_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PC_22_16_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PC16 to PC22 Mask */
#define SFRBU_IO_RETENTION_PC_22_16(value)    (SFRBU_IO_RETENTION_PC_22_16_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PC_22_16_Pos)) /* Assigment of value for PC_22_16 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PD_7_0_Pos         _UINT32_(12)                                         /* (SFRBU_IO_RETENTION) Keep Function on PD0 to PD7 Position */
#define SFRBU_IO_RETENTION_PD_7_0_Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_7_0_Pos)     /* (SFRBU_IO_RETENTION) Keep Function on PD0 to PD7 Mask */
#define SFRBU_IO_RETENTION_PD_7_0(value)      (SFRBU_IO_RETENTION_PD_7_0_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_7_0_Pos)) /* Assigment of value for PD_7_0 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PD_15_8_Pos        _UINT32_(13)                                         /* (SFRBU_IO_RETENTION) Keep Function on PD8 to PD15 Position */
#define SFRBU_IO_RETENTION_PD_15_8_Msk        (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_15_8_Pos)    /* (SFRBU_IO_RETENTION) Keep Function on PD8 to PD15 Mask */
#define SFRBU_IO_RETENTION_PD_15_8(value)     (SFRBU_IO_RETENTION_PD_15_8_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_15_8_Pos)) /* Assigment of value for PD_15_8 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PD_23_16_Pos       _UINT32_(14)                                         /* (SFRBU_IO_RETENTION) Keep Function on PD16 to PD23 Position */
#define SFRBU_IO_RETENTION_PD_23_16_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_23_16_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PD16 to PD23 Mask */
#define SFRBU_IO_RETENTION_PD_23_16(value)    (SFRBU_IO_RETENTION_PD_23_16_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_23_16_Pos)) /* Assigment of value for PD_23_16 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_PD_30_24_Pos       _UINT32_(15)                                         /* (SFRBU_IO_RETENTION) Keep Function on PD24 to PD30 Position */
#define SFRBU_IO_RETENTION_PD_30_24_Msk       (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_30_24_Pos)   /* (SFRBU_IO_RETENTION) Keep Function on PD24 to PD30 Mask */
#define SFRBU_IO_RETENTION_PD_30_24(value)    (SFRBU_IO_RETENTION_PD_30_24_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_30_24_Pos)) /* Assigment of value for PD_30_24 in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_NRST_Pos           _UINT32_(16)                                         /* (SFRBU_IO_RETENTION) Keep Function on NRST Position */
#define SFRBU_IO_RETENTION_NRST_Msk           (_UINT32_(0x1) << SFRBU_IO_RETENTION_NRST_Pos)       /* (SFRBU_IO_RETENTION) Keep Function on NRST Mask */
#define SFRBU_IO_RETENTION_NRST(value)        (SFRBU_IO_RETENTION_NRST_Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_NRST_Pos)) /* Assigment of value for NRST in the SFRBU_IO_RETENTION register */
#define SFRBU_IO_RETENTION_Msk                _UINT32_(0x0001F7FF)                                 /* (SFRBU_IO_RETENTION) Register Mask  */

