Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfrbu.h
#define SFRBU_IO_RETENTION_PA_7__Pos          _UINT32_(0)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PAx to PA7 */
#define SFRBU_IO_RETENTION_PA_7__Msk          (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_7__Pos)      /* (SFRBU_IO_RETENTION Mask) PA_7_ */
#define SFRBU_IO_RETENTION_PA_7_(value)       (SFRBU_IO_RETENTION_PA_7__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_7__Pos)) 
#define SFRBU_IO_RETENTION_PA_15__Pos         _UINT32_(1)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PA8 to PAx5 */
#define SFRBU_IO_RETENTION_PA_15__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_15__Pos)     /* (SFRBU_IO_RETENTION Mask) PA_15_ */
#define SFRBU_IO_RETENTION_PA_15_(value)      (SFRBU_IO_RETENTION_PA_15__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_15__Pos)) 
#define SFRBU_IO_RETENTION_PA_23__Pos         _UINT32_(2)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PAx6 to PA23 */
#define SFRBU_IO_RETENTION_PA_23__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_23__Pos)     /* (SFRBU_IO_RETENTION Mask) PA_23_ */
#define SFRBU_IO_RETENTION_PA_23_(value)      (SFRBU_IO_RETENTION_PA_23__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_23__Pos)) 
#define SFRBU_IO_RETENTION_PA_31__Pos         _UINT32_(3)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PA24 to PA3x */
#define SFRBU_IO_RETENTION_PA_31__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PA_31__Pos)     /* (SFRBU_IO_RETENTION Mask) PA_31_ */
#define SFRBU_IO_RETENTION_PA_31_(value)      (SFRBU_IO_RETENTION_PA_31__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PA_31__Pos)) 
#define SFRBU_IO_RETENTION_PB_7__Pos          _UINT32_(4)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PBx to PB7 */
#define SFRBU_IO_RETENTION_PB_7__Msk          (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_7__Pos)      /* (SFRBU_IO_RETENTION Mask) PB_7_ */
#define SFRBU_IO_RETENTION_PB_7_(value)       (SFRBU_IO_RETENTION_PB_7__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_7__Pos)) 
#define SFRBU_IO_RETENTION_PB_15__Pos         _UINT32_(5)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PB8 to PBx5 */
#define SFRBU_IO_RETENTION_PB_15__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_15__Pos)     /* (SFRBU_IO_RETENTION Mask) PB_15_ */
#define SFRBU_IO_RETENTION_PB_15_(value)      (SFRBU_IO_RETENTION_PB_15__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_15__Pos)) 
#define SFRBU_IO_RETENTION_PB_23__Pos         _UINT32_(6)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PB2x6 to PB23 */
#define SFRBU_IO_RETENTION_PB_23__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_23__Pos)     /* (SFRBU_IO_RETENTION Mask) PB_23_ */
#define SFRBU_IO_RETENTION_PB_23_(value)      (SFRBU_IO_RETENTION_PB_23__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_23__Pos)) 
#define SFRBU_IO_RETENTION_PB_26__Pos         _UINT32_(7)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PB24 to PB26 */
#define SFRBU_IO_RETENTION_PB_26__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PB_26__Pos)     /* (SFRBU_IO_RETENTION Mask) PB_26_ */
#define SFRBU_IO_RETENTION_PB_26_(value)      (SFRBU_IO_RETENTION_PB_26__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PB_26__Pos)) 
#define SFRBU_IO_RETENTION_PC_7__Pos          _UINT32_(8)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PCx to PC7 */
#define SFRBU_IO_RETENTION_PC_7__Msk          (_UINT32_(0x1) << SFRBU_IO_RETENTION_PC_7__Pos)      /* (SFRBU_IO_RETENTION Mask) PC_7_ */
#define SFRBU_IO_RETENTION_PC_7_(value)       (SFRBU_IO_RETENTION_PC_7__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PC_7__Pos)) 
#define SFRBU_IO_RETENTION_PC_15__Pos         _UINT32_(9)                                          /* (SFRBU_IO_RETENTION Position) Keep Function on PC8 to PCx5 */
#define SFRBU_IO_RETENTION_PC_15__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PC_15__Pos)     /* (SFRBU_IO_RETENTION Mask) PC_15_ */
#define SFRBU_IO_RETENTION_PC_15_(value)      (SFRBU_IO_RETENTION_PC_15__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PC_15__Pos)) 
#define SFRBU_IO_RETENTION_PC_22__Pos         _UINT32_(10)                                         /* (SFRBU_IO_RETENTION Position) Keep Function on PCx6 to PC22 */
#define SFRBU_IO_RETENTION_PC_22__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PC_22__Pos)     /* (SFRBU_IO_RETENTION Mask) PC_22_ */
#define SFRBU_IO_RETENTION_PC_22_(value)      (SFRBU_IO_RETENTION_PC_22__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PC_22__Pos)) 
#define SFRBU_IO_RETENTION_PD_7__Pos          _UINT32_(12)                                         /* (SFRBU_IO_RETENTION Position) Keep Function on PDx to PD7 */
#define SFRBU_IO_RETENTION_PD_7__Msk          (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_7__Pos)      /* (SFRBU_IO_RETENTION Mask) PD_7_ */
#define SFRBU_IO_RETENTION_PD_7_(value)       (SFRBU_IO_RETENTION_PD_7__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_7__Pos)) 
#define SFRBU_IO_RETENTION_PD_15__Pos         _UINT32_(13)                                         /* (SFRBU_IO_RETENTION Position) Keep Function on PD8 to PDx5 */
#define SFRBU_IO_RETENTION_PD_15__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_15__Pos)     /* (SFRBU_IO_RETENTION Mask) PD_15_ */
#define SFRBU_IO_RETENTION_PD_15_(value)      (SFRBU_IO_RETENTION_PD_15__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_15__Pos)) 
#define SFRBU_IO_RETENTION_PD_23__Pos         _UINT32_(14)                                         /* (SFRBU_IO_RETENTION Position) Keep Function on PDx6 to PD23 */
#define SFRBU_IO_RETENTION_PD_23__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_23__Pos)     /* (SFRBU_IO_RETENTION Mask) PD_23_ */
#define SFRBU_IO_RETENTION_PD_23_(value)      (SFRBU_IO_RETENTION_PD_23__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_23__Pos)) 
#define SFRBU_IO_RETENTION_PD_30__Pos         _UINT32_(15)                                         /* (SFRBU_IO_RETENTION Position) Keep Function on PD24 to PD3x */
#define SFRBU_IO_RETENTION_PD_30__Msk         (_UINT32_(0x1) << SFRBU_IO_RETENTION_PD_30__Pos)     /* (SFRBU_IO_RETENTION Mask) PD_30_ */
#define SFRBU_IO_RETENTION_PD_30_(value)      (SFRBU_IO_RETENTION_PD_30__Msk & (_UINT32_(value) << SFRBU_IO_RETENTION_PD_30__Pos)) 

