Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfrbu.h
/* -------- SFRBU_BODCORE : (SFRBU Offset: 0x40) (R/W 32) BOD Core Register -------- */
#define SFRBU_BODCORE_STATUS_Pos              _UINT32_(0)                                          /* (SFRBU_BODCORE) Core Brownout Detector Position */
#define SFRBU_BODCORE_STATUS_Msk              (_UINT32_(0x1) << SFRBU_BODCORE_STATUS_Pos)          /* (SFRBU_BODCORE) Core Brownout Detector Mask */
#define SFRBU_BODCORE_STATUS(value)           (SFRBU_BODCORE_STATUS_Msk & (_UINT32_(value) << SFRBU_BODCORE_STATUS_Pos)) /* Assigment of value for STATUS in the SFRBU_BODCORE register */
#define SFRBU_BODCORE_Msk                     _UINT32_(0x00000001)                                 /* (SFRBU_BODCORE) Register Mask  */


/* -------- SFRBU_PWS_CNTRL : (SFRBU Offset: 0x50) (R/W 32) Power Switch Control Register -------- */
#define SFRBU_PWS_CNTRL_UNMASK_Pos            _UINT32_(0)                                          /* (SFRBU_PWS_CNTRL) Unmask Power Switch Control Signals Position */
#define SFRBU_PWS_CNTRL_UNMASK_Msk            (_UINT32_(0x1) << SFRBU_PWS_CNTRL_UNMASK_Pos)        /* (SFRBU_PWS_CNTRL) Unmask Power Switch Control Signals Mask */
#define SFRBU_PWS_CNTRL_UNMASK(value)         (SFRBU_PWS_CNTRL_UNMASK_Msk & (_UINT32_(value) << SFRBU_PWS_CNTRL_UNMASK_Pos)) /* Assigment of value for UNMASK in the SFRBU_PWS_CNTRL register */
#define SFRBU_PWS_CNTRL_Msk                   _UINT32_(0x00000001)                                 /* (SFRBU_PWS_CNTRL) Register Mask  */


/* -------- SFRBU_WPMR : (SFRBU Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SFRBU_WPMR_WPEN_Pos                   _UINT32_(0)                                          /* (SFRBU_WPMR) Write Protection Enable Position */
#define SFRBU_WPMR_WPEN_Msk                   (_UINT32_(0x1) << SFRBU_WPMR_WPEN_Pos)               /* (SFRBU_WPMR) Write Protection Enable Mask */
#define SFRBU_WPMR_WPEN(value)                (SFRBU_WPMR_WPEN_Msk & (_UINT32_(value) << SFRBU_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SFRBU_WPMR register */
#define SFRBU_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (SFRBU_WPMR) Write Protection Key Position */
#define SFRBU_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << SFRBU_WPMR_WPKEY_Pos)         /* (SFRBU_WPMR) Write Protection Key Mask */
#define SFRBU_WPMR_WPKEY(value)               (SFRBU_WPMR_WPKEY_Msk & (_UINT32_(value) << SFRBU_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SFRBU_WPMR register */
#define   SFRBU_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x534652)                                   /* (SFRBU_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define SFRBU_WPMR_WPKEY_PASSWD               (SFRBU_WPMR_WPKEY_PASSWD_Val << SFRBU_WPMR_WPKEY_Pos) /* (SFRBU_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define SFRBU_WPMR_Msk                        _UINT32_(0xFFFFFF01)                                 /* (SFRBU_WPMR) Register Mask  */


/* -------- SFRBU_WPSR : (SFRBU Offset: 0xE8) (R/W 32) Write Protection Status Register -------- */
#define SFRBU_WPSR_WPVS_Pos                   _UINT32_(0)                                          /* (SFRBU_WPSR) Write Protection Violation Status Position */
#define SFRBU_WPSR_WPVS_Msk                   (_UINT32_(0x1) << SFRBU_WPSR_WPVS_Pos)               /* (SFRBU_WPSR) Write Protection Violation Status Mask */
#define SFRBU_WPSR_WPVS(value)                (SFRBU_WPSR_WPVS_Msk & (_UINT32_(value) << SFRBU_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the SFRBU_WPSR register */
#define SFRBU_WPSR_WPSRC_Pos                  _UINT32_(8)                                          /* (SFRBU_WPSR) Write Protection Source Position */
#define SFRBU_WPSR_WPSRC_Msk                  (_UINT32_(0xFFFF) << SFRBU_WPSR_WPSRC_Pos)           /* (SFRBU_WPSR) Write Protection Source Mask */
#define SFRBU_WPSR_WPSRC(value)               (SFRBU_WPSR_WPSRC_Msk & (_UINT32_(value) << SFRBU_WPSR_WPSRC_Pos)) /* Assigment of value for WPSRC in the SFRBU_WPSR register */
#define SFRBU_WPSR_Msk                        _UINT32_(0x00FFFF01)                                 /* (SFRBU_WPSR) Register Mask  */


/* -------- SFRBU_SPARE : (SFRBU Offset: 0xF0) (R/W 32) Spare Register -------- */
#define SFRBU_SPARE_VALUE_Pos                 _UINT32_(0)                                          /* (SFRBU_SPARE) Spare Position */
#define SFRBU_SPARE_VALUE_Msk                 (_UINT32_(0xFFFFFFFF) << SFRBU_SPARE_VALUE_Pos)      /* (SFRBU_SPARE) Spare Mask */
#define SFRBU_SPARE_VALUE(value)              (SFRBU_SPARE_VALUE_Msk & (_UINT32_(value) << SFRBU_SPARE_VALUE_Pos)) /* Assigment of value for VALUE in the SFRBU_SPARE register */
#define SFRBU_SPARE_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (SFRBU_SPARE) Register Mask  */


/** \brief SFRBU register offsets definitions */
#define SFRBU_XTAL_TRIM_REG_OFST       _UINT32_(0x10)      /* (SFRBU_XTAL_TRIM) XTAL Oscillator Trimming Register Offset */
#define SFRBU_TRIM_REG_OFST            _UINT32_(0x14)      /* (SFRBU_TRIM) Trimming Bits Register Offset */
#define SFRBU_BOOT_REG_OFST            _UINT32_(0x20)      /* (SFRBU_BOOT) Boot Register Offset */
#define SFRBU_IO_RETENTION_REG_OFST    _UINT32_(0x30)      /* (SFRBU_IO_RETENTION) IO Retention Register Offset */
#define SFRBU_BODCORE_REG_OFST         _UINT32_(0x40)      /* (SFRBU_BODCORE) BOD Core Register Offset */
#define SFRBU_PWS_CNTRL_REG_OFST       _UINT32_(0x50)      /* (SFRBU_PWS_CNTRL) Power Switch Control Register Offset */
#define SFRBU_WPMR_REG_OFST            _UINT32_(0xE4)      /* (SFRBU_WPMR) Write Protection Mode Register Offset */
#define SFRBU_WPSR_REG_OFST            _UINT32_(0xE8)      /* (SFRBU_WPSR) Write Protection Status Register Offset */
#define SFRBU_SPARE_REG_OFST           _UINT32_(0xF0)      /* (SFRBU_SPARE) Spare Register Offset */

