Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfrbu.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SFRBU register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       SFRBU_XTAL_TRIM;    /**< Offset: 0x10 (R/W  32) XTAL Oscillator Trimming Register */
  __I   uint32_t                       SFRBU_TRIM;         /**< Offset: 0x14 (R/   32) Trimming Bits Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  uint32_t                       SFRBU_BOOT;         /**< Offset: 0x20 (R/W  32) Boot Register */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       SFRBU_IO_RETENTION; /**< Offset: 0x30 (R/W  32) IO Retention Register */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       SFRBU_BODCORE;      /**< Offset: 0x40 (R/W  32) BOD Core Register */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       SFRBU_PWS_CNTRL;    /**< Offset: 0x50 (R/W  32) Power Switch Control Register */
  __I   uint8_t                        Reserved6[0x90];
  __IO  uint32_t                       SFRBU_WPMR;         /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __IO  uint32_t                       SFRBU_WPSR;         /**< Offset: 0xE8 (R/W  32) Write Protection Status Register */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       SFRBU_SPARE;        /**< Offset: 0xF0 (R/W  32) Spare Register */
} sfrbu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_SFRBU_COMPONENT_H_ */
